# WrongConstraintInGridChainSketch Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..WrongConstraintInGridChainSketch Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Curve in a GridChain sketch cannot be constrained to a sub-grid
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WrongConstraintInGridChainSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WrongConstraintInGridChainSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WrongConstraintInGridChainSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace